In [1]:
import numpy as np
import pandas as pd

In [3]:
!cat examples/ex1.csv

cat: examples/ex1.csv: No such file or directory

In [6]:
df=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
pd.read_table('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
parsed=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/csv_mindex.csv',index_col=['key1','key2'])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result=pd.read_table('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex3.csv',sep='\s+')

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
!cat /Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [18]:
pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [19]:
!cat /Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [20]:
result=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex5.csv')

In [21]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [22]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [24]:
result=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex5.csv',na_values=['NULL'])

In [25]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [26]:
sentinels={'message':['foo','NA'],'something':['two']}

In [27]:
pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [30]:
result=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex6.csv',nrows=5)

In [31]:
result

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [32]:
chunker=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex6.csv',chunksize=1000)

In [33]:
tot=pd.Series([])

In [37]:
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
    
tot=tot.sort_values(ascending=False)

In [39]:
tot[:10]

E    265.0
X    248.0
M    243.0
P    243.0
Q    238.0
J    238.0
L    237.0
K    236.0
Y    232.0
U    230.0
dtype: float64

In [40]:
data=pd.read_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/ex5.csv')

In [41]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/out5.csv ')

In [45]:
!cat /Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/out5.csv

cat: /Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/out5.csv: No such file or directory

In [46]:
import sys

In [50]:
obj = """
    {"name": "Wes",
     "places_lived": ["United States", "Spain", "Germany"],
     "pet": null,
     "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [51]:
import json

In [52]:
result=json.loads(obj)

In [53]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [54]:
asjoin=json.dumps(result)

In [55]:
asjoin

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [56]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [57]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [58]:
data=pd.read_json('/Users/yezhibin/Downloads/书/数据分析书/Notes-on-Python-for-Data-Analysis-2nd-Edition-master/examples/example.json')

In [59]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9